; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite3 - satellite
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	satellite4 - satellite
	instrument11 - instrument
	instrument12 - instrument
	image2 - mode
	image3 - mode
	infrared1 - mode
	spectrograph0 - mode
	Star0 - direction
	GroundStation4 - direction
	GroundStation2 - direction
	Star3 - direction
	GroundStation1 - direction
	Star5 - direction
	Star6 - direction
	Star7 - direction
	Star8 - direction
	Star9 - direction
	Star10 - direction
	Star11 - direction
	Star12 - direction
	Planet13 - direction
	Star14 - direction
	Phenomenon15 - direction
	Planet16 - direction
	Planet17 - direction
	Planet18 - direction
	Planet19 - direction
	Planet20 - direction
	Planet21 - direction
	Star22 - direction
	Phenomenon23 - direction
	Phenomenon24 - direction
	Planet25 - direction
	Star26 - direction
	Phenomenon27 - direction
	Star28 - direction
	Star29 - direction
)
(:init
	(supports instrument0 image3)
	(supports instrument0 image2)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 GroundStation4)
	(supports instrument1 infrared1)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star9)
	(supports instrument2 image2)
	(supports instrument2 spectrograph0)
	(supports instrument2 image3)
	(calibration_target instrument2 GroundStation4)
	(supports instrument3 image3)
	(supports instrument3 infrared1)
	(supports instrument3 spectrograph0)
	(calibration_target instrument3 GroundStation1)
	(supports instrument4 infrared1)
	(supports instrument4 image2)
	(supports instrument4 image3)
	(calibration_target instrument4 Star3)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star9)
	(supports instrument5 image2)
	(supports instrument5 image3)
	(supports instrument5 spectrograph0)
	(calibration_target instrument5 GroundStation2)
	(supports instrument6 image3)
	(supports instrument6 spectrograph0)
	(supports instrument6 image2)
	(calibration_target instrument6 GroundStation2)
	(supports instrument7 image3)
	(supports instrument7 infrared1)
	(supports instrument7 spectrograph0)
	(calibration_target instrument7 GroundStation4)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star0)
	(supports instrument8 image3)
	(supports instrument8 infrared1)
	(supports instrument8 image2)
	(calibration_target instrument8 GroundStation2)
	(supports instrument9 infrared1)
	(supports instrument9 image2)
	(calibration_target instrument9 Star3)
	(supports instrument10 image3)
	(supports instrument10 infrared1)
	(supports instrument10 image2)
	(calibration_target instrument10 Star3)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(on_board instrument10 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star22)
	(supports instrument11 image2)
	(calibration_target instrument11 GroundStation1)
	(supports instrument12 spectrograph0)
	(supports instrument12 infrared1)
	(supports instrument12 image3)
	(calibration_target instrument12 GroundStation1)
	(on_board instrument11 satellite4)
	(on_board instrument12 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation4)
)
(:goal (and
	(pointing satellite1 Planet16)
	(pointing satellite3 Planet17)
	(have_image Star5 image3)
	(have_image Star6 image2)
	(have_image Star7 image3)
	(have_image Star8 infrared1)
	(have_image Star9 spectrograph0)
	(have_image Star10 image2)
	(have_image Star11 image3)
	(have_image Star12 image3)
	(have_image Planet13 spectrograph0)
	(have_image Star14 spectrograph0)
	(have_image Phenomenon15 image3)
	(have_image Planet16 infrared1)
	(have_image Planet17 infrared1)
	(have_image Planet18 infrared1)
	(have_image Planet19 image3)
	(have_image Planet20 image2)
	(have_image Planet21 infrared1)
	(have_image Star22 spectrograph0)
	(have_image Phenomenon24 image2)
	(have_image Star26 image2)
	(have_image Phenomenon27 spectrograph0)
	(have_image Star28 image2)
))

)

; plan
1. (switch_on instrument11 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument11)
   goals met: 0 of 24
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 24
3. (switch_on instrument7 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument7)
   goals met: 0 of 24
4. (turn_to satellite3 planet17 star22)
   deleted: (pointing satellite3 star22)
   added: (pointing satellite3 planet17)
   goals met: 1 of 24
5. (turn_to satellite2 groundstation4 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 groundstation4)
   goals met: 1 of 24
6. (calibrate satellite2 instrument7 groundstation4)
   added: (calibrated instrument7)
   goals met: 1 of 24
7. (turn_to satellite2 phenomenon15 groundstation4)
   deleted: (pointing satellite2 groundstation4)
   added: (pointing satellite2 phenomenon15)
   goals met: 1 of 24
8. (take_image satellite2 phenomenon15 instrument7 image3)
   added: (have_image phenomenon15 image3)
   goals met: 2 of 24
9. (turn_to satellite2 phenomenon27 phenomenon15)
   deleted: (pointing satellite2 phenomenon15)
   added: (pointing satellite2 phenomenon27)
   goals met: 2 of 24
10. (take_image satellite2 phenomenon27 instrument7 spectrograph0)
   added: (have_image phenomenon27 spectrograph0)
   goals met: 3 of 24
11. (turn_to satellite2 planet13 phenomenon27)
   deleted: (pointing satellite2 phenomenon27)
   added: (pointing satellite2 planet13)
   goals met: 3 of 24
12. (take_image satellite2 planet13 instrument7 spectrograph0)
   added: (have_image planet13 spectrograph0)
   goals met: 4 of 24
13. (turn_to satellite2 planet16 planet13)
   deleted: (pointing satellite2 planet13)
   added: (pointing satellite2 planet16)
   goals met: 4 of 24
14. (take_image satellite2 planet16 instrument7 infrared1)
   added: (have_image planet16 infrared1)
   goals met: 5 of 24
15. (turn_to satellite2 planet17 planet16)
   deleted: (pointing satellite2 planet16)
   added: (pointing satellite2 planet17)
   goals met: 5 of 24
16. (take_image satellite2 planet17 instrument7 infrared1)
   added: (have_image planet17 infrared1)
   goals met: 6 of 24
17. (turn_to satellite2 planet18 planet17)
   deleted: (pointing satellite2 planet17)
   added: (pointing satellite2 planet18)
   goals met: 6 of 24
18. (take_image satellite2 planet18 instrument7 infrared1)
   added: (have_image planet18 infrared1)
   goals met: 7 of 24
19. (turn_to satellite2 planet19 planet18)
   deleted: (pointing satellite2 planet18)
   added: (pointing satellite2 planet19)
   goals met: 7 of 24
20. (take_image satellite2 planet19 instrument7 image3)
   added: (have_image planet19 image3)
   goals met: 8 of 24
21. (turn_to satellite2 planet21 planet19)
   deleted: (pointing satellite2 planet19)
   added: (pointing satellite2 planet21)
   goals met: 8 of 24
22. (take_image satellite2 planet21 instrument7 infrared1)
   added: (have_image planet21 infrared1)
   goals met: 9 of 24
23. (turn_to satellite2 star11 planet21)
   deleted: (pointing satellite2 planet21)
   added: (pointing satellite2 star11)
   goals met: 9 of 24
24. (take_image satellite2 star11 instrument7 image3)
   added: (have_image star11 image3)
   goals met: 10 of 24
25. (turn_to satellite2 star12 star11)
   deleted: (pointing satellite2 star11)
   added: (pointing satellite2 star12)
   goals met: 10 of 24
26. (take_image satellite2 star12 instrument7 image3)
   added: (have_image star12 image3)
   goals met: 11 of 24
27. (turn_to satellite2 star14 star12)
   deleted: (pointing satellite2 star12)
   added: (pointing satellite2 star14)
   goals met: 11 of 24
28. (take_image satellite2 star14 instrument7 spectrograph0)
   added: (have_image star14 spectrograph0)
   goals met: 12 of 24
29. (turn_to satellite2 star22 star14)
   deleted: (pointing satellite2 star14)
   added: (pointing satellite2 star22)
   goals met: 12 of 24
30. (take_image satellite2 star22 instrument7 spectrograph0)
   added: (have_image star22 spectrograph0)
   goals met: 13 of 24
31. (turn_to satellite2 star5 star22)
   deleted: (pointing satellite2 star22)
   added: (pointing satellite2 star5)
   goals met: 13 of 24
32. (take_image satellite2 star5 instrument7 image3)
   added: (have_image star5 image3)
   goals met: 14 of 24
33. (turn_to satellite2 star7 star5)
   deleted: (pointing satellite2 star5)
   added: (pointing satellite2 star7)
   goals met: 14 of 24
34. (take_image satellite2 star7 instrument7 image3)
   added: (have_image star7 image3)
   goals met: 15 of 24
35. (turn_to satellite2 star8 star7)
   deleted: (pointing satellite2 star7)
   added: (pointing satellite2 star8)
   goals met: 15 of 24
36. (take_image satellite2 star8 instrument7 infrared1)
   added: (have_image star8 infrared1)
   goals met: 16 of 24
37. (turn_to satellite2 star9 star8)
   deleted: (pointing satellite2 star8)
   added: (pointing satellite2 star9)
   goals met: 16 of 24
38. (take_image satellite2 star9 instrument7 spectrograph0)
   added: (have_image star9 spectrograph0)
   goals met: 17 of 24
39. (turn_to satellite1 planet16 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 planet16)
   goals met: 18 of 24
40. (turn_to satellite0 groundstation4 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 groundstation4)
   goals met: 18 of 24
41. (calibrate satellite0 instrument0 groundstation4)
   added: (calibrated instrument0)
   goals met: 18 of 24
42. (turn_to satellite0 phenomenon24 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 phenomenon24)
   goals met: 18 of 24
43. (take_image satellite0 phenomenon24 instrument0 image2)
   added: (have_image phenomenon24 image2)
   goals met: 19 of 24
44. (turn_to satellite0 planet20 phenomenon24)
   deleted: (pointing satellite0 phenomenon24)
   added: (pointing satellite0 planet20)
   goals met: 19 of 24
45. (take_image satellite0 planet20 instrument0 image2)
   added: (have_image planet20 image2)
   goals met: 20 of 24
46. (turn_to satellite0 star10 planet20)
   deleted: (pointing satellite0 planet20)
   added: (pointing satellite0 star10)
   goals met: 20 of 24
47. (take_image satellite0 star10 instrument0 image2)
   added: (have_image star10 image2)
   goals met: 21 of 24
48. (turn_to satellite0 star26 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star26)
   goals met: 21 of 24
49. (take_image satellite0 star26 instrument0 image2)
   added: (have_image star26 image2)
   goals met: 22 of 24
50. (turn_to satellite0 star28 star26)
   deleted: (pointing satellite0 star26)
   added: (pointing satellite0 star28)
   goals met: 22 of 24
51. (take_image satellite0 star28 instrument0 image2)
   added: (have_image star28 image2)
   goals met: 23 of 24
52. (turn_to satellite0 star6 star28)
   deleted: (pointing satellite0 star28)
   added: (pointing satellite0 star6)
   goals met: 23 of 24
53. (take_image satellite0 star6 instrument0 image2)
   added: (have_image star6 image2)
   goals met: 24 of 24
